Tekla.Structures.Catalogs.ShapeItem
The Shape class contains information about the shapes in the Tekla Structures shape catalog.

Tekla.Structures.Catalogs.ShapeItem.Guid
The Guid of this shape.

Tekla.Structures.Catalogs.ShapeItem.GeometryGuid
The Guid of the geometry of this shape

Tekla.Structures.Catalogs.ShapeItem.GeometryHash
Gets the geometry hash. If a client wants to use this property for some purposes, it should
provide a value at CatalogHandler.Insert() operation. The model itself does not calculate this value.

Tekla.Structures.Catalogs.ShapeItem.Extrema
Get or sets the extrema of the shape geometry.

Tekla.Structures.Catalogs.ShapeItem.IsSolid
Gets a value indicating whether the geometry is a solid.